#------------------------------Сумма нечетных чисел------------------------------
# mas = [4,3,2,8,5,2,0]
# sum = 0
# for i in range (len(mas)):
#     if(i%2==0):
#         sum+=mas[i]
# print('Сумма элементов на нечетных позициях: ', sum, "для массива ", mas)
#------------------------------Произведение пар чисел списка------------------------------
# mas = [2, 3, 4, 5, 6]
# print('Массив ', mas)
# result = []
# while (len(mas)!=0):
#     if len(mas)==1:
#         result.append(mas[0]**2)
#         break
#     result.append(mas.pop(0)*mas.pop(-1))
# print("Произведение пар чисел для массива равно ", result)
#------------------------------Разница между макс и мин значением дробной части элементов------------------------------
# mas = [1.1, 1.2, 3.1, 5, 10.01]
# masCor= []
# print('Массив: ', mas)
# for i in range(len(mas)):
#     k = round(mas[i]%1, 7)
#     if(k!=0):
#          masCor.append(round(mas[i]%1, 9))
# max=masCor[0]
# min=masCor[0]
# for i in range(1,len(masCor)):
#     if(max<masCor[i]): max=masCor[i]
#     if(min>masCor[i]): min=masCor[i]
# print('Разница: ',max-min)
#------------------------------Преобразовывать десятичное число в двоичное------------------------------
n=1175
print('Число для перевода в двоичную систему ', n)
print('Представдение в двоичной системе числа c использованием встроенной функции ', bin(n))  
dNum = []
while n!=0:
    if n%2!=0:
        dNum.append(1)
        n=n//2
    else:
        dNum.append(0)
        n=n//2
      
print('Представдение в двоичной системе числа', "".join(map(str, dNum[::-1])))